# -*- coding: utf-8 -*-

import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import Lasso
import os
import glob
import pickle
from pprint import pprint

# get data
files=glob.glob("wolvez2022/spm/b_spm1/b-data/bcca_secondinput/*")
pprint(files)
"""
['wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-07-36.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-07-42.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-07-16.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-07-29.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-08-08.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-07-55.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-07-49.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-08-02.npz',
 'wolvez2022/spm/b_spm1/b-data/bcca_secondinput/2022-06-25_23-07-23.npz']
 """

# generate train_X
train_X=[]
for file in files:
    data_dicts=np.load(file,allow_pickle=True)["array_1"][0].values()
    pprint(data_dicts)
    train_X_situ=[]
    for dict in data_dicts:
        element=list(dict.values())
        for ele in element:
            train_X_situ.append(ele)
    train_X.append(train_X_situ)
train_X=np.array(train_X)
"""
npzの中身
array(
    [
        {
            normalRGB': {'win_6': {}, 'var': 220.55700312989046, 'med': 233.0, 'ave': 2649.8010542425563}, 
            'enphasis': {'win_6': {}, 'var': 147.84209702660408, 'med': 142.0, 'ave': 1644.1443937245451}, 
            'edge': {'win_6': {}, 'var': 128.30614241001564, 'med': 131.0, 'ave': 658.1063941956818}, 
            'hsv': {'win_6': {}, 'var': 217.62386541471048, 'med': 226.0, 'ave': 1636.250776294876}, 
            'red': {'win_6': {}, 'var': 154.02214397496087, 'med': 156.0, 'ave': 798.201778814952}, 
            'blue': {'win_6': {}, 'var': 136.0475743348983, 'med': 139.0, 'ave': 975.8083000629407}, 
            'green': {'win_6': {}, 'var': 197.31353677621283, 'med': 199.0, 'ave': 433.5493472721216}, 
            'purple': {'win_6': {}, 'var': 163.00050860719875, 'med': 165.0, 'ave': 609.9759387084548}, 
            'emerald': {'win_6': {}, 'var': 206.13212050078246, 'med': 208.0, 'ave': 353.44306842992404}, 
            'yellow': {'win_6': {}, 'var': 221.16060250391237, 'med': 225.0, 'ave': 862.2499893083506}
        }
    ],
    dtype=object)
array(
    [
        {'normalRGB': {'win_6': {}, 'var': 221.11236306729265, 'med': 233.0, 'ave': 2392.279471567713}, 
        'enphasis': {'win_6': {}, 'var': 147.85078247261345, 'med': 142.0, 'ave': 1634.1568421107415}, 
        'edge': {'win_6': {}, 'var': 128.33368544600938, 'med': 131.0, 'ave': 679.6661579354845}, 
        'hsv': {'win_6': {}, 'var': 216.08607198748044, 'med': 225.0, 'ave': 1848.4967387178228}, 
        'red': {'win_6': {}, 'var': 153.87104851330204, 'med': 156.0, 'ave': 782.1801633763632}, 
        'blue': {'win_6': {}, 'var': 136.05140845070423, 'med': 139.0, 'ave': 970.8513477815249}, 
        'green': {'win_6': {}, 'var': 196.77425665101723, 'med': 199.0, 'ave': 406.3017003472758}, 
        'purple': {'win_6': {}, 'var': 162.68462441314554, 'med': 165.0, 'ave': 616.0747557666027}, 
        'emerald': {'win_6': {}, 'var': 205.4768779342723, 'med': 207.0, 'ave': 363.0326422088872}, 
        'yellow': {'win_6': {}, 'var': 220.8122848200313, 'med': 225.0, 'ave': 788.7293952490811}}],
      dtype=object)
array([
    {'normalRGB': {'win_6': {}, 'var': 214.910406885759, 'med': 236.0, 'ave': 4397.546276673254}, 
    'enphasis': {'win_6': {}, 'var': 147.78262910798122, 'med': 142.0, 'ave': 1633.150011241156}, 
    'edge': {'win_6': {}, 'var': 128.066744913928, 'med': 130.0, 'ave': 668.8521961336791}, 
    'hsv': {'win_6': {}, 'var': 222.27989045383413, 'med': 226.0, 'ave': 678.5713483448072}, 
    'red': {'win_6': {}, 'var': 155.25641627543035, 'med': 157.0, 'ave': 764.992779645181}, 
    'blue': {'win_6': {}, 'var': 136.48176838810642, 'med': 139.0, 'ave': 968.8360525848535}, 
    'green': {'win_6': {}, 'var': 199.7962441314554, 'med': 202.0, 'ave': 405.0077010734202}, 'purple': {'win_6': {}, 'var': 164.63998435054773, 'med': 167.0, 'ave': 605.3828300467035}, 'emerald': {'win_6': {}, 'var': 209.06772300469484, 'med': 211.0, 'ave': 355.58441985441607}, 'yellow': {'win_6': {}, 'var': 222.42335680751174, 'med': 229.0, 'ave': 1309.4956125190106}}],
      dtype=object)
array([{'normalRGB': {'win_6': {}, 'var': 219.25931142410016, 'med': 234.0, 'ave': 3130.837452421012}, 'enphasis': {'win_6': {}, 'var': 147.92093114241, 'med': 142.0, 'ave': 1645.6493427949458}, 'edge': {'win_6': {}, 'var': 128.2816510172144, 'med': 131.0, 'ave': 646.4033409361139}, 'hsv': {'win_6': {}, 'var': 220.22034428794993, 'med': 226.0, 'ave': 1113.656690961278}, 'red': {'win_6': {}, 'var': 154.454186228482, 'med': 157.0, 'ave': 740.8515004723613}, 'blue': {'win_6': {}, 'var': 136.30066510172145, 'med': 139.0, 'ave': 972.8675425936334}, 'green': {'win_6': {}, 'var': 198.11463223787166, 'med': 200.0, 'ave': 438.2429627364255}, 'purple': {'win_6': {}, 'var': 163.47128325508606, 'med': 166.0, 'ave': 605.6093474925366}, 'emerald': {'win_6': {}, 'var': 207.10371674491392, 'med': 209.0, 'ave': 366.6575135723487}, 'yellow': {'win_6': {}, 'var': 221.88665884194054, 'med': 227.0, 'ave': 948.271073969683}}],
      dtype=object)
array([{'normalRGB': {'win_6': {}, 'var': 219.90575117370892, 'med': 223.0, 'ave': 697.9913127768962}, 'enphasis': {'win_6': {}, 'var': 147.70426447574334, 'med': 142.0, 'ave': 1534.3322196859212}, 'edge': {'win_6': {}, 'var': 128.0950704225352, 'med': 131.0, 'ave': 709.0756251515352}, 'hsv': {'win_6': {}, 'var': 217.46408450704226, 'med': 222.0, 'ave': 828.7834518614031}, 'red': {'win_6': {}, 'var': 151.28912363067292, 'med': 154.0, 'ave': 624.4297878078768}, 'blue': {'win_6': {}, 'var': 135.21400625978092, 'med': 138.0, 'ave': 947.2231371580202}, 'green': {'win_6': {}, 'var': 189.9040297339593, 'med': 192.0, 'ave': 447.35045324481223}, 'purple': {'win_6': {}, 'var': 159.37464788732393, 'med': 162.0, 'ave': 617.5228627476912}, 'emerald': {'win_6': {}, 'var': 197.80293427230046, 'med': 200.0, 'ave': 341.1068223759616}, 'yellow': {'win_6': {}, 'var': 213.53231611893582, 'med': 216.0, 'ave': 415.10740637268225}}],
      dtype=object)
array([{'normalRGB': {'win_6': {}, 'var': 220.21596244131456, 'med': 224.0, 'ave': 797.0021865150212}, 'enphasis': {'win_6': {}, 'var': 147.7209702660407, 'med': 142.0, 'ave': 1539.404536773764}, 'edge': {'win_6': {}, 'var': 128.19010172143976, 'med': 131.0, 'ave': 706.793712665709}, 'hsv': {'win_6': {}, 'var': 217.93082942097027, 'med': 222.0, 'ave': 686.3546051023582}, 'red': {'win_6': {}, 'var': 151.51388888888889, 'med': 154.0, 'ave': 664.9066146105025}, 'blue': {'win_6': {}, 'var': 135.2640062597809, 'med': 138.0, 'ave': 901.1736496775823}, 'green': {'win_6': {}, 'var': 190.36764475743348, 'med': 192.0, 'ave': 444.41057285658826}, 'purple': {'win_6': {}, 'var': 159.68892801251957, 'med': 162.0, 'ave': 636.6508476771339}, 'emerald': {'win_6': {}, 'var': 198.41482785602503, 'med': 200.0, 'ave': 350.4838255180973}, 'yellow': {'win_6': {}, 'var': 214.23947574334898, 'med': 217.0, 'ave': 412.9528626359531}}],
      dtype=object)
array([{'normalRGB': {'win_6': {}, 'var': 219.95985915492957, 'med': 224.0, 'ave': 846.5098128127136}, 'enphasis': {'win_6': {}, 'var': 147.5359546165884, 'med': 142.0, 'ave': 1566.0177213500529}, 'edge': {'win_6': {}, 'var': 128.2070813771518, 'med': 131.0, 'ave': 648.3695194941602}, 'hsv': {'win_6': {}, 'var': 217.62237871674492, 'med': 222.0, 'ave': 756.8637401946017}, 'red': {'win_6': {}, 'var': 151.5091158059468, 'med': 154.0, 'ave': 766.9708871681227}, 'blue': {'win_6': {}, 'var': 135.24385758998434, 'med': 138.0, 'ave': 930.6437024898916}, 'green': {'win_6': {}, 'var': 190.34557902973395, 'med': 192.0, 'ave': 429.1166862453193}, 'purple': {'win_6': {}, 'var': 159.69694835680752, 'med': 162.0, 'ave': 621.7936839582094}, 'emerald': {'win_6': {}, 'var': 198.43532863849765, 'med': 200.0, 'ave': 358.3090414021689}, 'yellow': {'win_6': {}, 'var': 214.07280907668232, 'med': 216.0, 'ave': 439.9445032201993}}],
      dtype=object)
array([{'normalRGB': {'win_6': {}, 'var': 220.15829420970266, 'med': 224.0, 'ave': 746.8679006896534}, 'enphasis': {'win_6': {}, 'var': 147.8544600938967, 'med': 142.0, 'ave': 1533.3842171967642}, 'edge': {'win_6': {}, 'var': 128.0160406885759, 'med': 131.0, 'ave': 713.151542383321}, 'hsv': {'win_6': {}, 'var': 217.36052425665102, 'med': 222.0, 'ave': 819.2273383793021}, 'red': {'win_6': {}, 'var': 151.5230046948357, 'med': 154.0, 'ave': 654.5843690625758}, 'blue': {'win_6': {}, 'var': 135.225, 'med': 138.0, 'ave': 916.8276613849765}, 'green': {'win_6': {}, 'var': 190.1579420970266, 'med': 192.0, 'ave': 438.62149404359553}, 'purple': {'win_6': {}, 'var': 159.60649452269172, 'med': 162.0, 'ave': 625.9570470230531}, 'emerald': {'win_6': {}, 'var': 198.11975743348984, 'med': 200.0, 'ave': 344.38452357183445}, 'yellow': {'win_6': {}, 'var': 214.00864632237872, 'med': 216.0, 'ave': 391.9740645212345}}],
      dtype=object)
array([{'normalRGB': {'win_6': {}, 'var': 217.40191705790298, 'med': 235.0, 'ave': 3679.7452310666727}, 'enphasis': {'win_6': {}, 'var': 147.6881846635368, 'med': 142.0, 'ave': 1648.1030059377304}, 'edge': {'win_6': {}, 'var': 128.02273082942096, 'med': 130.0, 'ave': 655.8732313532123}, 'hsv': {'win_6': {}, 'var': 219.72003129890453, 'med': 226.0, 'ave': 1198.72412143877}, 'red': {'win_6': {}, 'var': 154.73427230046948, 'med': 157.0, 'ave': 768.5078707928321}, 'blue': {'win_6': {}, 'var': 136.41697965571205, 'med': 139.0, 'ave': 1003.3567226459085}, 'green': {'win_6': {}, 'var': 198.8186228482003, 'med': 201.0, 'ave': 432.94973143678624}, 'purple': {'win_6': {}, 'var': 164.06537558685446, 'med': 166.0, 'ave': 627.1190828401552}, 'emerald': {'win_6': {}, 'var': 207.95254303599373, 'med': 210.0, 'ave': 358.1646101213873}, 'yellow': {'win_6': {}, 'var': 222.11017214397495, 'med': 228.0, 'ave': 1123.1654833819468}}],
      dtype=object)

"""

"""
for file in files:
    pprint(np.load(file,allow_pickle=True)["array_1"][0])
path=os.getcwd()
"""#train_X=np.load(path+"/second_input_data/2022-06-09_18-44-40.npz")["array_1"]
# 特徴画像の数＊特徴量ベクトル＊学習画像の数　を想定
test_X=train_X[-1].reshape(1,-1)
train_X=train_X[:-1]
train_y=np.zeros((train_X.shape[0],1))
test_y=0
print(train_X.shape,test_X.shape,train_y.shape)
train_y[-5:]=1
model=Lasso(max_iter=1000)
model.fit(train_X,train_y)
possibility=model.predict(test_X)
print(possibility)
"""
・Xを1次元にも3次元にもできない問題
・今後何らかの支障になるかもなと思い、できればここをロバストにしてみたいと思うところです。
"""